/* 1951559 计算机 谢佳依 */
#include <iostream>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   4、整个程序不允许出现任何形式的循环（while、do-while、for、if-goto）
   --------------------------------------------------------------------- */

/***************************************************************************
	函数名称：convert
	功    能：将整数n分解后输出
	输入参数：int n : 需要处理的整数
	返 回 值：
	说    明：1、函数名、形参、返回类型均不准动
			2、不允许使用64位整数
***************************************************************************/
void convert(int n)
{
	if (n == -2147483648)
	{
		convert(n/10);
		cout << " ";
		convert(n / 10 * 10 - n);
		return;
	}
	if (n < 0)
	{
		n = -n;
		cout << "- ";
		convert(n);
		return;
	}
	else
	{
		if (n <= 9 && n >= 0)
		{
			cout << n;
			return;
		}
		int k;
		k = n % 10;
		convert(n / 10);
		cout << " " << k;
	}
	return;
}

/***************************************************************************
  函数名称：main
  功    能：得到输入和调用函数
  输入参数：无
  返 回 值：0
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int n;
	cout << "请输入一个整数" << endl;
	cin >> n;

	convert(n);
	cout << endl;

	return 0;
}